In [1]:
import pandas as pd
import numpy as np

Dados ausentes

In [2]:
d = {"Corinthians": [7, 31, 2], "Palmeiras": [12, 28, np.nan]}
df = pd.DataFrame(d, index=["Brasileirão", "Paulistão", "Mundial"])
df # Crie uma tabela com dados das prêmiações do futebol, comparando palmeiras e corinthians

             Corinthians  Palmeiras
Brasileirão            7       12.0
Paulistão             31       28.0
Mundial                2        NaN

In [3]:
df.isnull() # coloca todos os dados em booleana, "true" é o dado auesente

             Corinthians  Palmeiras
Brasileirão        False      False
Paulistão          False      False
Mundial            False       True

In [4]:
df.isnull().sum() # verifica os dados ausentes e depois conta quantos que tem em cada coluna, no caso tem 1 no palmeiras

Corinthians    0
Palmeiras      1
dtype: int64

In [8]:
df.dropna() # apaga a linha do dado ausente

             Corinthians  Palmeiras
Brasileirão            7       12.0
Paulistão             31       28.0

In [5]:
df.fillna(method="ffill") # Preenchi o dado ausente com o valor acima

C:\Users\User\AppData\Local\Temp\ipykernel_13392\4230306975.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill") # Preenchi o dado ausente com o valor acima

             Corinthians  Palmeiras
Brasileirão            7       12.0
Paulistão             31       28.0
Mundial                2       28.0

In [6]:
df.fillna(method="bfill") # Preenche com o valor da linha de baixo, porém como não fica ausente

C:\Users\User\AppData\Local\Temp\ipykernel_13392\1857956796.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="bfill") # Preenche com o valor da linha de baixo, porém como não fica ausente

             Corinthians  Palmeiras
Brasileirão            7       12.0
Paulistão             31       28.0
Mundial                2        NaN

Juntar, mesclar e concatenar

In [7]:
df1 = pd.DataFrame({
    "Time": ["Corinthians", "Palmeiras", "São Paulo"],
    "Pontos": [40, 38, 35]
})

df2 = pd.DataFrame({
    "Time": ["Flamengo", "Vasco", "Botafogo"],
    "Pontos": [45, 30, 50]
})

In [9]:
df1 # tabela 1

          Time  Pontos
0  Corinthians      40
1    Palmeiras      38
2    São Paulo      35

In [10]:
df2 # tabela 2

       Time  Pontos
0  Flamengo      45
1     Vasco      30
2  Botafogo      50

In [11]:
concatenar = pd.concat([df1, df2]) # estão unindo ambas tabelas

In [12]:
concatenar

          Time  Pontos
0  Corinthians      40
1    Palmeiras      38
2    São Paulo      35
0     Flamengo      45
1        Vasco      30
2     Botafogo      50

In [13]:
df_esquerda = pd.DataFrame({
    "Time": ["Corinthians", "Palmeiras", "São Paulo"],
    "Cidade": ["São Paulo", "São Paulo", "São Paulo"]
})

df_direita = pd.DataFrame({
    "Time": ["Corinthians", "Palmeiras", "Flamengo"],
    "Titulos": [30, 25, 40]
})

In [14]:
mergeDF= pd.merge(df_esquerda, df_direita, on="Time", how="inner") # está juntando os dados que contem em ambos igualmente, no caso apenas corinthians e palmeiras

In [15]:
mergeDF

          Time     Cidade  Titulos
0  Corinthians  São Paulo       30
1    Palmeiras  São Paulo       25

In [16]:
df_left = pd.DataFrame({
    "Pontos": [40, 38, 35]
}, index=["Corinthians", "Palmeiras", "São Paulo"])

df_right = pd.DataFrame({
    "Titulos": [30, 25, 18]
}, index=["Corinthians", "Palmeiras", "Flamengo"])

In [17]:
join_df = df_left.join(df_right, how="outer") # ele junta ambos na tabela sem tirar nenhuma das linhas, porém onde não são iguais é colocado com ausente

In [18]:
join_df

             Pontos  Titulos
Corinthians    40.0     30.0
Flamengo        NaN     18.0
Palmeiras      38.0     25.0
São Paulo      35.0      NaN

DataFrame

In [19]:
df = pd.DataFrame({
    "Time": ["Corinthians", "Palmeiras", "Corinthians", "Palmeiras", "Flamengo"],
    "Gols": [10, 15, 7, 20, 25],
    "Pontos": [30, 28, 25, 32, 40]
})

In [20]:
df

          Time  Gols  Pontos
0  Corinthians    10      30
1    Palmeiras    15      28
2  Corinthians     7      25
3    Palmeiras    20      32
4     Flamengo    25      40

Operações com a tabela

In [23]:
df["Gols+Pontos"] = df["Gols"] + df["Pontos"] # somou 2 colunas em uma nova coluna

In [24]:
df

          Time  Gols  Pontos  Gols+Pontos
0  Corinthians    10      30           40
1    Palmeiras    15      28           43
2  Corinthians     7      25           32
3    Palmeiras    20      32           52
4     Flamengo    25      40           65

In [25]:
df["Gols x2"] = df["Gols"] * 2 # multiplicou  coluna gols por 2 em uma nova coluna

In [26]:
df

          Time  Gols  Pontos  Gols+Pontos  Gols x2
0  Corinthians    10      30           40       20
1    Palmeiras    15      28           43       30
2  Corinthians     7      25           32       14
3    Palmeiras    20      32           52       40
4     Flamengo    25      40           65       50

In [27]:
group_sum = df.groupby("Time").sum() # Agrupou a tabela pela coluna time, depois somou os valores de cada time duplicado

In [28]:
group_sum

             Gols  Pontos  Gols+Pontos  Gols x2
Time
Corinthians    17      55           72       34
Flamengo       25      40           65       50
Palmeiras      35      60           95       70

In [30]:
group_mean = df.groupby("Time")["Gols"].mean() # agrupou pela coluna time e mostrou a média dos gols de cada time no caso dividiu pela quantidade de nome

In [31]:
group_mean

Time
Corinthians     8.5
Flamengo       25.0
Palmeiras      17.5
Name: Gols, dtype: float64

In [32]:
group_desc = df.groupby("Time").describe() # agrupa pela coluna time e calcula estatísticas descritivas para cada grupo

In [33]:
group_desc

             Gols                                                 Pontos  \
            count  mean       std   min    25%   50%    75%   max  count
Time
Corinthians   2.0   8.5  2.121320   7.0   7.75   8.5   9.25  10.0    2.0
Flamengo      1.0  25.0       NaN  25.0  25.00  25.0  25.00  25.0    1.0
Palmeiras     2.0  17.5  3.535534  15.0  16.25  17.5  18.75  20.0    2.0

                   ... Gols+Pontos       Gols x2                              \
             mean  ...         75%   max   count  mean       std   min   25%
Time               ...
Corinthians  27.5  ...       38.00  40.0     2.0  17.0  4.242641  14.0  15.5
Flamengo     40.0  ...       65.00  65.0     1.0  50.0       NaN  50.0  50.0
Palmeiras    30.0  ...       49.75  52.0     2.0  35.0  7.071068  30.0  32.5


              50%   75%   max
Time
Corinthians  17.0  18.5  20.0
Flamengo     50.0  50.0  50.0
Palmeiras    35.0  37.5  40.0

[3 rows x 32 columns]